Stocko-2073/stocko/u-bot/firmware/base/sdkconfig.defaults
# U-BOT base firmware -- build defaults. Anything not listed here is the
# ESP-IDF v6.1 default for the esp32s3.

CONFIG_IDF_TARGET="esp32s3"

# --- flash and partitions --------------------------------------------------
# The XIAO ESP32-S3 carries 8 MB flash and 8 MB quad PSRAM (confirmed by
# `esptool flash-id` on the module: device c8:4017, eFuse quad @ 3.3 V).
# partitions.csv is still the 4 MB layout, which fits and simply leaves the
# upper half unused -- enlarge the OTA slots there if an image ever outgrows
# 0x1E0000. PSRAM is left disabled; the Sense's camera would need it on.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# OTA: a new image boots once as "pending verify" and is rolled back by the
# bootloader unless the app marks itself valid. main.c does that once the
# management health check confirms the expected candidate.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- console: the XIAO's USB port is the S3's native USB Serial/JTAG --------
# On the S3 that is GPIO19/20, so neither is available as a general-purpose pin.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# --- scheduling -------------------------------------------------------------
# 1 kHz tick so the blocking bench moves (calibration, jog) can pump at 1 ms
# and the 5 ms control period is a whole number of ticks.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The control task is on the task watchdog. If it wedges, the WDT resets the
# chip and the EN pull-up disables both drivers -- which matters under UART
# velocity mode, where a driver keeps stepping without anyone talking to it.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=3
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# --- logging ------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=n

# --- networking ---------------------------------------------------------------
CONFIG_HTTPD_WS_SUPPORT=y
# v6 does not call the URI handler on the handshake GET; clients are greeted here.
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_LWIP_LOCAL_HOSTNAME="ubot"
CONFIG_ESP_WIFI_NVS_ENABLED=y
# Keep Wi-Fi on core 1, separate from the Bluetooth controller and NimBLE.
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# --- BLE (NimBLE, peripheral only) ----------------------------------------------
CONFIG_UBOT_BLE_ENABLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_GAP_SERVICE=y
CONFIG_BT_NIMBLE_BAS_SERVICE=y
CONFIG_BT_NIMBLE_SVC_BAS_BATTERY_LEVEL_NOTIFY=y
CONFIG_BT_NIMBLE_DIS_SERVICE=y
CONFIG_BT_NIMBLE_SVC_DIS_MANUFACTURER_NAME=y
CONFIG_BT_NIMBLE_SVC_DIS_HARDWARE_REVISION=y
CONFIG_BT_NIMBLE_SVC_DIS_FIRMWARE_REVISION=y
CONFIG_BT_NIMBLE_SVC_DIS_SERIAL_NUMBER=y

# --- C++ ----------------------------------------------------------------------
# The drive stack is C++ without exceptions or RTTI.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# OTA sends small HTTPS GET requests; retain full-size incoming TLS records.
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=1024

# Management request parsing and acknowledged indications share the host stack.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
